#+TITLE: Day 3, Part 1

#+begin_src jq :in-file d3test.txt :cmd-line -nR
198 as $answer |

# shamelessly stolen from rosettacode because I was lazy
def to_i(base): explode
  | reverse
  | map(if . > 96  then . - 87 else . - 48 end)
  | reduce .[] as $c ([1,0]; (.[0] * base) as $b | [$b, .[1] + (.[0] * $c)])
  | .[1]
;

[inputs | split("")]
  | transpose
  | (.[0] | length) as $l
  | [ .[]
      | map(select(. == "1"))
      | add
      | length as $ones
      | if $ones > $l/2 then ["1","0"] else ["0","1"] end
    ]
  | transpose
  | map(add) | map(to_i(2)) | first * last == $answer
#+end_src

#+RESULTS:
: true

#+begin_src jq :in-file d3input.txt :cmd-line -nR
def to_i(base): explode
  | reverse
  | map(if . > 96  then . - 87 else . - 48 end)
  | reduce .[] as $c ([1,0]; (.[0] * base) as $b | [$b, .[1] + (.[0] * $c)])
  | .[1]
;

[inputs | split("")]
  | transpose
  | (.[0] | length) as $l
  | [ .[]
      | map(select(. == "1"))
      | add
      | length as $ones
      | if $ones > $l/2 then ["1","0"] else ["0","1"] end
    ]
  | transpose
  | map(add) | map(to_i(2)) | first * last
#+end_src

#+RESULTS:
: 1540244
